package boluo.basics;

import org.junit.Test;

import java.util.Arrays;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Note16_String {

	@Test
	public void func1() {
		// 分割字符串且保留切割符
		String str = "管理费标准：1000元/台/年；管理费半年度结算，水电费季度结算，到达每个周期后2周内甲方开具增值税专用发票，乙方在收到发票3个工作日内支付到甲方账户。\n" +
				"注：原合同约定紫金港投放18+16=34台；2019年12月11日签订补充协议，约定于2019年12月1日起增加12+8=20台，累计投放54台。\n" +
				"2021.2.4进行留学生门店拆出创建新项目。\n" +
				"门店编号：428  费用：7000.00\n" +
				"门店编号：429  费用：7000.00\n" +
				"门店编号：430  费用：4000.00\n" +
				"门店编号：431  费用：4000.00\n" +
				"门店编号：432  费用：4000.00\n" +
				"门店编号：433  费用：4000.00\n" +
				"门店编号：434  费用：4000.00\n" +
				"截止2019-11-30，每年费用34000.00元。（洗烘设备数量18台+16台=34台）\n" +
				"门店编号：428  费用：7000.00\n" +
				"门店编号：429  费用：7000.00\n" +
				"门店编号：430  费用：4000.00\n" +
				"门店编号：431  费用：4000.00\n" +
				"门店编号：432  费用：4000.00\n" +
				"门店编号：433  费用：4000.00\n" +
				"门店编号：434  费用：4000.00\n" +
				"门店编号：897  费用：20000.00\n" +
				"截止2021-01-30，每年费用54000.00元。（洗烘设备数量18台+16台=34台）\n" +
				"门店编号：428  费用：7000.00\n" +
				"门店编号：429  费用：7000.00\n" +
				"门店编号：430  费用：4000.00\n" +
				"门店编号：431  费用：4000.00\n" +
				"门店编号：432  费用：4000.00\n" +
				"门店编号：433  费用：4000.00\n" +
				"门店编号：434  费用：4000.00\n" +
				"门店编号：897  费用：20000.00\n";

		String pattern = "截止\\d{4}-\\d{2}-\\d{2}，每年费用([\\d\\.]+)元.*";

		//1. 定义匹配模式
		Pattern p = Pattern.compile(pattern);
		Matcher m = p.matcher(str);

		//2. 拆分句子[拆分后的句子符号也没了]
		String[] words = p.split(str);

		//3. 保留原来的分隔符
		if (words.length > 0) {
			int count = 0;
			while (count < words.length) {
				if (m.find()) {
					words[count] += m.group();
				}
				count++;
			}
		}
		Arrays.stream(words).forEach(System.out::println);
	}

	@Test
	public void func2() {
		String str1 = "1,2,3,4";            // 切割成 1,    2,     3,     4
		String str2 = "1,2,3,";            // 切割成 1,    2,     3,     ""
		String str3 = "1,2,,3";            // 切割成 1,    2,     ,      3

	}
}
